In [16]:
import pandas as pd
import mysql.connector as connector

In [17]:
connection = connector.connect(
    host="localhost",
    port="3306",
    user="root",
    password="admin",
    database="sakila"
)

In [18]:
df_tables = pd.read_sql("SHOW TABLES",connection)
df_tables.head()

C:\Users\bardo\AppData\Local\Temp\ipykernel_2828\102794977.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_tables = pd.read_sql("SHOW TABLES",connection)

  Tables_in_sakila
0            actor
1       actor_info
2          address
3         category
4             city

In [ ]:
## REVISAR  A  PARTIR  DE  AQU√ç ##

df_staff = pd.read_sql("SHOW * FROM staff",connection)
df_address = pd.read_sql("SHOW * FROM address",connection)
df_city = pd.read_sql("SHOW * FROM city",connection)
df_country = pd.read_sql("SHOW * FROM country",connection)
df_tables.head(20)

In [21]:
df_address.head(1)

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 62, 10, 50, 93, 99...",2014-09-25 22:30:27

In [15]:
df_staff_address =pd.merge(df_staff,df_address, on='address_id')
df_staff_address = df_staff_address[['first_name']]

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update_x,address,address2,district,city_id,postal_code,phone,location,last_update_y
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16,23 Workhaven Lane,None,Alberta,300,,14033335568,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 205, 196, 25, 104,...",2014-09-25 22:30:27
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16,1411 Lillydale Drive,None,QLD,576,,6172235589,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 91, 13, 228, 52, 3...",2014-09-25 22:30:09